app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First Post with nice syling"], ["body", "Ayy finally"], ["user_id", 1], ["created_at", "2019-08-02 20:29:47.292667"], ["updated_at", "2019-08-02 20:29:47.292667"]]
---
  def create
    @post = current_user.posts.build(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def upvote
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def downvote
    @post = Post.find(params[:id])